// // -------------------------------------------------------------- #1
// let i=0;
// while (i<2) {
//    console.log('Привет!');
//     i++;
// }
// // -------------------------------------------------------------- #2
// let i=1;
// while (i<=5) {
//     console.log(i);
//     i++
// }
// // -------------------------------------------------------------- #3
// let i=0
// while (i<=22) {
//     if (i>=7)
//     console.log(i);
//     i++
// }
// // -------------------------------------------------------------- #4
// const obj = {
// 	"Коля": '200',
// 	"Вася": '300',
// 	"Петя": '400',
// };
// for (let name in obj) { 
//         console.log( `${name}  — зарплата ${obj[name]} рублей `);
//        }
// // -------------------------------------------------------------- #5
// let n=1000;
// num=0 ;
// for ( ; n>=50 ; n=n/2 , num++) {

// }
// console.log(`Количество итераций равно ${num}` );
// console.log(`Первое число, меньшее 50, равно ${n}`);
// // -------------------------------------------------------------- #6
// let mounth=0;
// let friday = Number(prompt('введите число первой пятницы месяца (от 1 до 7)')) ;
// if (friday > 7) {
// 	alert('Не корректное число');
// } else {
// 	for (  ; mounth <= 31 ; friday=friday + 7,  mounth=+friday ) {

// 		 alert(`Сегодня пятница, ${friday}-е число. Необходимо подготовить отчет.`);

// 	}
// }

